[
    {
        "name": "Les Éternels",
        "director": "Réalisateur : Chloé Zhao",
        "releaseYear": 2021,
        "picture": "./assets/photos/eternels.jpg",
        "cast": ["Gemma Chan", "Richard Madden", "Angeline Jolie", "Salma Hayek", "Kumail Nanjiani", "Harry Styles", "..."],
        "resume": "Depuis l'aube de l'humanité, les Éternels, un groupe de héros venus des confins de l'univers, protègent la Terre. Lorsque les Déviants, des créatures monstrueuses que l'on croyait disparues depuis longtemps, réapparaissent mystérieusement, les Éternels sont à nouveau obligés de se réunir pour défendre l'humanité…"
    },
    {
        "name": "Black Widow",
        "director": "Réalisateur : Cate Shortland",
        "releaseYear": 2021,
        "picture": "./assets/photos/widow.jpg",
        "cast": ["Scarlett Johansson", "Florence Pugh", "Rachel Weisz", "..."],
        "resume": "Natasha Romanoff, alias Black Widow, voit resurgir la part la plus sombre de son passé pour faire face à une redoutable conspiration liée à sa vie d’autrefois. Poursuivie par une force qui ne reculera devant rien pour l’abattre, Natasha doit renouer avec ses activités d’espionne et avec des liens qui furent brisés, bien avant qu’elle ne rejoigne les Avengers. "
    },
    {
        "name": "Black Adam",
        "director": "Réalisateur : Jaume Collet-Serra",
        "releaseYear": 2022,
        "picture": "./assets/photos/adam.jpg",
        "cast": ["Dwayne Johnson", "Aldis Hodge", "Pierce Brosnan", "..."],
        "resume": "Dans l’antique Kahndaq, l’esclave Teth Adam avait reçu les super-pouvoirs des dieux. Mais il en a fait usage pour se venger et a fini en prison. 5000 ans , alors qu’il a été libéré, il fait régner sa conception très sombre de la justice dans le monde. Refusant de se rendre, Teth Adam doit affronter une bande de héros d’aujourd’hui qui composent la Justice Society qui comptent bien le renvoyer en prison pour l’éternité."
    },
    {
        "name": "Thor: Love And Thunder",
        "director": "Réalisateur : Taika Waititi",
        "releaseYear": 2022,
        "picture": "./assets/photos/thor.jpg",
        "cast": ["Chris Hemsworth", "Natalie Portman", "..."],
        "resume": "Thor voit sa retraite interrompue par un tueur galactique qui s’est donné pour mission d’exterminer tous les dieux. Aidé par Valkyrie, Korg et son ex-petite amie, il se lance dans une dangereuse aventure pour comprendre les motivations de Gorr et l’arrêter."
    },
    {
        "name": "Doctor Strange in the Multiverse of Madness",
        "director": "Réalisateur : Sam Raimi",
        "releaseYear": 2022,
        "picture": "./assets/photos/strange.jpg",
        "cast": ["Elizabeth Olsen", "Chiwetel Ejiofor", "..."],
        "resume": "Voyagez dans l’inconnu avec Doctor Strange, qui avec l’aide d’anciens et de nouveaux alliés, traverse les réalités hallucinantes et dangereuses du multivers pour affronter un nouvel adversaire."
    },
    {
        "name": "Spider-Man: No Way Home",
        "director": "Réalisateur : Jon Watts",
        "releaseYear": 2021,
        "picture": "./assets/photos/spiderman.jpg",
        "cast": ["Tom Holland", "Zendaya", "Benedict Cumberbatch", "..."],
        "resume": "Spider-Man est démasqué et ne peut désormais plus séparer sa vie normale de ses lourdes responsabilités de super-héros. Quand il demande de l'aide à Doctor Strange, les enjeux deviennent encore plus dangereux, le forçant à découvrir sa destinée."
    },
    {
        "name": "Morbius",
        "director": "Réalisateur : Daniel Espinosa",
        "releaseYear": 2022,
        "picture": "./assets/photos/morbius.jpg",
        "cast": ["Jared Leto", "Matt Smith (XI)", "Adria Arjona", "..."],
        "resume": "                                     Gravement atteint d’une rare maladie sanguine, et déterminé à sauver toutes les victimes de cette pathologie, le Dr Morbius tente un pari désespéré. Alors que son expérience semble être un succès, le remède déclenche un effet sinistre. Le bien vaincra-t-il le mal – ou Morbius succombera-t-il à ses nouvelles pulsions ? "
    },
    {
        "name": "Les Gardiens de la Galaxie 2",
        "director": "Réalisateur : James Gunn",
        "releaseYear": 2017,
        "picture": "./assets/photos/gardiens.jpg",
        "cast": ["Chris Pratt", "Zoe Saldana", "Dave Bautista", "..."],
        "resume": "Les gardiens doivent combattre pour rester unis alors qu'ils découvrent les mystères de la filiation de Peter Quill. Les vieux ennemis vont devenir de nouveaux alliés et tandis que d'autres personnages vont venir aider nos héros."
    },
    {
        "name": "Deadpool 2",
        "director": "Réalisateur : David Leitch",
        "releaseYear": 2018,
        "picture": "./assets/photos/pool.jpg",
        "cast": ["Ryan Reynolds", "Josh Brolin", "Morena Baccarin", "..."],
        "resume": "L’insolent mercenaire de Marvel remet le masque ! Plus grand, plus-mieux, et occasionnellement les fesses à l’air, il devra affronter un Super-Soldat dressé pour tuer, repenser l’amitié, la famille, et ce que signifie l’héroïsme – tout en bottant cinquante nuances de culs, car comme chacun sait, pour faire le Bien, il faut parfois se salir les doigts."
    },
    {
        "name": "Avengers: Infinity War",
        "director": "Réalisateur : Joe Russo, Anthony Russo",
        "releaseYear": 2018,
        "picture": "./assets/photos/infinity.jpg",
        "cast": ["Robert Downey Jr.", "Chris Hemsworth", "Mark Ruffalo", "..."],
        "resume": "Les Avengers et leurs alliés devront être prêts à tout sacrifier pour neutraliser le redoutable Thanos avant que son attaque éclair ne conduise à la destruction complète de l’univers."
    }
]